{
    "basic" : {
        "name": "Kevin Bosman",
        "label": "Software Developer",
        "email": "bosmankevin89@gmail.com",
        "phone": "920-585-7420",
        "website": "",
        "summary": "",
        "location": {
          "city": "Madison",
          "countryCode": "US",
          "state": "Wisconsin"
        }
    },
    "education": [
        {
          "educationLevel": "College",
          "institution": "University of Wisconsin - Oshkosh",
          "major": "Majored in Computer Science with an emphasis in Software Engineering",
          "degreeType" : "Bachelor of Science"
        }
  ],
  "skills":[
      {
          "groupName": "Languages:",
          "keywords": [
                "Java", "JavaScript", "C#", "HTML", "CSS"
          ]
      },
      {
          "groupName": "Databases:",
          "keywords": [
                "Microsoft SQL Server", "T-SQL", "Oracle", "PL/SQL", "PostgreSQL9.6"
          ]
      }
  ],
  "work": [
      {
          "company" : "VersiFit Technologies, LLC",
          "city" : "Appleton",
          "state" : "WI",
          "titles" : [
              {
                  "title" : "Associate Developer & Analyst",
                  "startDate" : "​January 2012",
                  "endDate" : "PRESENT",
                  "current" : true
              },
              {
                  "title" : "Intern",
                  "startDate" : "​May 2011",
                  "endDate" : "​January 2012",
                  "current" : false
              }
          ],
          "highlights" : [
              "Formulated, discussed, and implemented design documents and software features with developers and clients.",
              "Collaborated in programming teams, as well as work independently to develop new software solutions.",
              "Trained clients in the operation and management of custom software.",
              "Assisted clients in troubleshooting software and database related issues.",
              "Created client-facing documentation for new and existing software.",
              "Implemented and maintained ETL procedures in multiple databases.",
              "Modified a scheduling program that manages the execution of various Java, SQL, and System tasks. Assisted in planning and upgrading the internal metadata structure. Developed additional task functionality.",
              "Developed a GUI-based program that assists clients and developers in defining and modifying metadata and tasks.",
              "Maintained programs based on Mozilla’s Rhino JavaScript engine that loads assessment data from vendor data files and converts them to standardized table records."
          ]
      }
  ]
}